content/food/malai-rigatoni.org
#+HTML_LINK_HOME: ../..
#+HTML_LINK_UP: ./
#+title: Malai Rigatoni
#+author: Vishal Narayan
#+OPTIONS: title:nil

* Malai Rigatoni

This is the dish inspired by Pijja Palace.

Got the recipe from [[https://theglobalvegetarian.com/recipes/malai-rigatoni][The Global Vegetarian]].

The recipe on this page is just for the sauce. Cooking the pasta is pretty self-explanatory.

** Ingredients
- 2 tbsp butter
- 1 tbsp olive oil

- 2 bay leaves
- 1 small red onion, finely chopped
- 8-10 cloves garlic, minced
- 1.5 tomatoes, finely chopped
- 2/3 cup tomato paste

- 1.5 tsp red chili powder
- 1-2 tsp red chili flakes
- 1/4 tsp turmeric
- 3/4 tsp cumin powder
- 1/4 tsp cardamom powder
- 1/2 tsp coriander powder
- salt to taste

- 1/4 cup vodka

- 1/4 tsp pepper
- 1/4 tsp sugar

- 1 cup heavy cream (can sub coconut milk)

- 3 tbsp chopped basil
- 3 tbsp chopped coriander


** Cook
1. Pan on low-medium heat. Add butter and oil, allow it to heat up.
2. Add bay leaves, let sizzle.
3. Add onions, cook until translucent.
4. Add garlic, saute until fragrant.
5. Add tomatoes, sauce until raw smell goes away.
6. Add tomato paste. Again, cook until raw smell goes away.
7. Add spices (rcp, turmeric, cardamom, chili flakes, cumin, coriander, salt).
8. Add vodka and mix to deglaze the pan.
9. Add pepper, salt, sugar.
10. Add pasta water. Add cream.
11. Add chopped herbs. 
