docs/food/malai-rigatoni.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="../.."> HOME </a>
</div><div id="content" class="content">

<div id="outline-container-orgdb8ed07" class="outline-2">
<h2 id="orgdb8ed07">Malai Rigatoni</h2>
<div class="outline-text-2" id="text-orgdb8ed07">
<p>
This is the dish inspired by Pijja Palace.
</p>

<p>
Got the recipe from <a href="https://theglobalvegetarian.com/recipes/malai-rigatoni">The Global Vegetarian</a>.
</p>

<p>
The recipe on this page is just for the sauce. Cooking the pasta is pretty self-explanatory.
</p>
</div>

<div id="outline-container-org7e4d215" class="outline-3">
<h3 id="org7e4d215">Ingredients</h3>
<div class="outline-text-3" id="text-org7e4d215">
<ul class="org-ul">
<li>2 tbsp butter</li>
<li>1 tbsp olive oil</li>

<li>2 bay leaves</li>
<li>1 small red onion, finely chopped</li>
<li>8-10 cloves garlic, minced</li>
<li>1.5 tomatoes, finely chopped</li>
<li>2/3 cup tomato paste</li>

<li>1.5 tsp red chili powder</li>
<li>1-2 tsp red chili flakes</li>
<li>1/4 tsp turmeric</li>
<li>3/4 tsp cumin powder</li>
<li>1/4 tsp cardamom powder</li>
<li>1/2 tsp coriander powder</li>
<li>salt to taste</li>

<li>1/4 cup vodka</li>

<li>1/4 tsp pepper</li>
<li>1/4 tsp sugar</li>

<li>1 cup heavy cream (can sub coconut milk)</li>

<li>3 tbsp chopped basil</li>
<li>3 tbsp chopped coriander</li>
</ul>
</div>
</div>


<div id="outline-container-orgbf39b67" class="outline-3">
<h3 id="orgbf39b67">Cook</h3>
<div class="outline-text-3" id="text-orgbf39b67">
<ol class="org-ol">
<li>Pan on low-medium heat. Add butter and oil, allow it to heat up.</li>
<li>Add bay leaves, let sizzle.</li>
<li>Add onions, cook until translucent.</li>
<li>Add garlic, saute until fragrant.</li>
<li>Add tomatoes, sauce until raw smell goes away.</li>
<li>Add tomato paste. Again, cook until raw smell goes away.</li>
<li>Add spices (rcp, turmeric, cardamom, chili flakes, cumin, coriander, salt).</li>
<li>Add vodka and mix to deglaze the pan.</li>
<li>Add pepper, salt, sugar.</li>
<li>Add pasta water. Add cream.</li>
<li>Add chopped herbs.</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
